9/data/attachments/4fc3d6876b119698.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_0fd1a867-3ee0-4023-b238-56d034f09df9</nif:username>
            <nif:friendToBeAdded>Jennifer_half_Friend_23284_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>